# MarkupsCreator Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MarkupsCreator Property
ParameterTypeId Class See Also
---
"Creator"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MarkupsCreator { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MarkupsCreator As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MarkupsCreator {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace